---
kind: property
id: P:Autodesk.Revit.DB.CeilingType.ThermalProperties
source: html/a5ef2aa8-db6b-61a1-2c16-f4cf3fc40782.htm
---
# Autodesk.Revit.DB.CeilingType.ThermalProperties Property

The calculated and settable thermal properties of the CeilingType

## Syntax (C#)
```csharp
public ThermalProperties ThermalProperties { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The ceiling does not have thermal properties.